# Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое слово с новой строки.
# Строки необходимо пронумеровать. Если в слово длинное, выводить только первые 10 букв в слове.

user_str = input('Input a sentence: ')
for ind, el in enumerate(user_str.split(), 1):
    print(ind, el[:10])
