# Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

from sys import argv
work_hours, rate_per_hour, bonus = argv[1:]
print(int(work_hours) * int(rate_per_hour) + int(bonus))
